<h1>Chapter5 合并 Table of Contents<span class="tocSkip"></span></h1>
<div class="toc"><ul class="toc-item"><li><span><a href="#chapter5-合并" data-toc-modified-id="chapter5-合并-1">chapter5 合并</a></span></li><li><span><a href="#一、append与assign" data-toc-modified-id="一、append与assign-2">一、append与assign</a></span><ul class="toc-item"><li><span><a href="#1.1-append方法" data-toc-modified-id="1.1-append方法-2.1">1.1 append方法</a></span><ul class="toc-item"><li><span><a href="#1.1.1-利用序列添加行（必须指定name）" data-toc-modified-id="1.1.1-利用序列添加行（必须指定name）-2.1.1">1.1.1 利用序列添加行（必须指定name）</a></span></li><li><span><a href="#1.1.2-用DataFrame添加表" data-toc-modified-id="1.1.2-用DataFrame添加表-2.1.2">1.1.2 用DataFrame添加表</a></span></li></ul></li><li><span><a href="#1.2-assign方法,-该方法主要用于添加列，列名直接由参数指定：" data-toc-modified-id="1.2-assign方法,-该方法主要用于添加列，列名直接由参数指定：-2.2">1.2 assign方法, 该方法主要用于添加列，列名直接由参数指定：</a></span></li></ul></li><li><span><a href="#二、combine与update" data-toc-modified-id="二、combine与update-3">二、combine与update</a></span><ul class="toc-item"><li><span><a href="#2.1-combine方法" data-toc-modified-id="2.1-combine方法-3.1">2.1 combine方法</a></span><ul class="toc-item"><li><span><a href="#2.1.1-填充对象" data-toc-modified-id="2.1.1-填充对象-3.1.1">2.1.1 填充对象</a></span></li><li><span><a href="#2.1.2-一些例子" data-toc-modified-id="2.1.2-一些例子-3.1.2">2.1.2 一些例子</a></span><ul class="toc-item"><li><span><a href="#2.1.2.1-例：根据列均值的大小填充" data-toc-modified-id="2.1.2.1-例：根据列均值的大小填充-3.1.2.1">2.1.2.1 例：根据列均值的大小填充</a></span></li><li><span><a href="#2.1.2.2-例：索引对齐特性（默认状态下，后面的表没有的行列都会设置为NaN）" data-toc-modified-id="2.1.2.2-例：索引对齐特性（默认状态下，后面的表没有的行列都会设置为NaN）-3.1.2.2">2.1.2.2 例：索引对齐特性（默认状态下，后面的表没有的行列都会设置为NaN）</a></span></li><li><span><a href="#2.1.2.3-例：使得df1原来符合条件的值不会被覆盖" data-toc-modified-id="2.1.2.3-例：使得df1原来符合条件的值不会被覆盖-3.1.2.3">2.1.2.3 例：使得df1原来符合条件的值不会被覆盖</a></span></li><li><span><a href="#2.1.2.4-例：在新增匹配df2的元素位置填充-1" data-toc-modified-id="2.1.2.4-例：在新增匹配df2的元素位置填充-1-3.1.2.4">2.1.2.4 例：在新增匹配df2的元素位置填充-1</a></span></li></ul></li><li><span><a href="#2.1.3-combine_first方法" data-toc-modified-id="2.1.3-combine_first方法-3.1.3">2.1.3 combine_first方法</a></span></li></ul></li><li><span><a href="#2.2-update方法" data-toc-modified-id="2.2-update方法-3.2">2.2 update方法</a></span><ul class="toc-item"><li><span><a href="#2.2.1-三个特点" data-toc-modified-id="2.2.1-三个特点-3.2.1">2.2.1 三个特点</a></span><ul class="toc-item"><li><span><a href="#2.2.1.2-返回的框索引只会与被调用框的一致（默认使用左连接，下一节会介绍）" data-toc-modified-id="2.2.1.2-返回的框索引只会与被调用框的一致（默认使用左连接，下一节会介绍）-3.2.1.1">2.2.1.2 返回的框索引只会与被调用框的一致（默认使用左连接，下一节会介绍）</a></span></li><li><span><a href="#2.2.1.3-第二个框中的nan元素不会起作用" data-toc-modified-id="2.2.1.3-第二个框中的nan元素不会起作用-3.2.1.2">2.2.1.3 第二个框中的nan元素不会起作用</a></span></li><li><span><a href="#2.2.1.4-没有返回值，直接在df上操作" data-toc-modified-id="2.2.1.4-没有返回值，直接在df上操作-3.2.1.3">2.2.1.4 没有返回值，直接在df上操作</a></span></li></ul></li><li><span><a href="#2.2.2-例子" data-toc-modified-id="2.2.2-例子-3.2.2">2.2.2 例子</a></span><ul class="toc-item"><li><span><a href="#2.2.2.1-例：索引完全对齐情况下的操作" data-toc-modified-id="2.2.2.1-例：索引完全对齐情况下的操作-3.2.2.1">2.2.2.1 例：索引完全对齐情况下的操作</a></span></li><li><span><a href="#2.2.2.2-例：部分填充" data-toc-modified-id="2.2.2.2-例：部分填充-3.2.2.2">2.2.2.2 例：部分填充</a></span></li><li><span><a href="#2.2.2.3-例：缺失值不会填充" data-toc-modified-id="2.2.2.3-例：缺失值不会填充-3.2.2.3">2.2.2.3 例：缺失值不会填充</a></span></li></ul></li></ul></li></ul></li><li><span><a href="#三、concat方法" data-toc-modified-id="三、concat方法-4">三、concat方法</a></span><ul class="toc-item"><li><ul class="toc-item"><li><ul class="toc-item"><li><span><a href="#3.1-默认状态拼接：" data-toc-modified-id="3.1-默认状态拼接：-4.0.0.1">3.1 默认状态拼接：</a></span></li><li><span><a href="#3.2-axis=1时沿列方向拼接：" data-toc-modified-id="3.2-axis=1时沿列方向拼接：-4.0.0.2">3.2 axis=1时沿列方向拼接：</a></span></li><li><span><a href="#3.3-join设置为内连接（由于axis=0，因此列取交集）：" data-toc-modified-id="3.3-join设置为内连接（由于axis=0，因此列取交集）：-4.0.0.3">3.3 join设置为内连接（由于axis=0，因此列取交集）：</a></span></li><li><span><a href="#3.4-join设置为外链接：" data-toc-modified-id="3.4-join设置为外链接：-4.0.0.4">3.4 join设置为外链接：</a></span></li><li><span><a href="#3.5-verify_integrity检查列是否唯一：" data-toc-modified-id="3.5-verify_integrity检查列是否唯一：-4.0.0.5">3.5 verify_integrity检查列是否唯一：</a></span></li><li><span><a href="#3.6-同样，可以添加Series：" data-toc-modified-id="3.6-同样，可以添加Series：-4.0.0.6">3.6 同样，可以添加Series：</a></span></li><li><span><a href="#3.7-key参数用于对不同的数据框增加一个标号，便于索引：" data-toc-modified-id="3.7-key参数用于对不同的数据框增加一个标号，便于索引：-4.0.0.7">3.7 key参数用于对不同的数据框增加一个标号，便于索引：</a></span></li></ul></li></ul></li></ul></li><li><span><a href="#四、merge与join" data-toc-modified-id="四、merge与join-5">四、merge与join</a></span><ul class="toc-item"><li><span><a href="#4.1.-merge函数" data-toc-modified-id="4.1.-merge函数-5.1">4.1. merge函数</a></span><ul class="toc-item"><li><ul class="toc-item"><li><span><a href="#4.1.1-以key1为准则连接，如果具有相同的列，则默认suffixes=('_x','_y')：" data-toc-modified-id="4.1.1-以key1为准则连接，如果具有相同的列，则默认suffixes=('_x','_y')：-5.1.0.1">4.1.1 以key1为准则连接，如果具有相同的列，则默认suffixes=('_x','_y')：</a></span></li><li><span><a href="#4.1.2-以多组键连接：" data-toc-modified-id="4.1.2-以多组键连接：-5.1.0.2">4.1.2 以多组键连接：</a></span></li><li><span><a href="#4.1.3-默认使用inner连接，因为merge只能横向拼接，所以取行向上keys的交集，下面看如果使用how=outer参数" data-toc-modified-id="4.1.3-默认使用inner连接，因为merge只能横向拼接，所以取行向上keys的交集，下面看如果使用how=outer参数-5.1.0.3">4.1.3 默认使用inner连接，因为merge只能横向拼接，所以取行向上keys的交集，下面看如果使用how=outer参数</a></span></li><li><span><a href="#4.1.4-左连接：" data-toc-modified-id="4.1.4-左连接：-5.1.0.4">4.1.4 左连接：</a></span></li><li><span><a href="#4.1.5-右连接：" data-toc-modified-id="4.1.5-右连接：-5.1.0.5">4.1.5 右连接：</a></span></li><li><span><a href="#4.1.6-如果还是对笛卡尔积不太了解，请务必理解下面这个例子，由于B的所有元素为2，因此需要6行：" data-toc-modified-id="4.1.6-如果还是对笛卡尔积不太了解，请务必理解下面这个例子，由于B的所有元素为2，因此需要6行：-5.1.0.6">4.1.6 如果还是对笛卡尔积不太了解，请务必理解下面这个例子，由于B的所有元素为2，因此需要6行：</a></span></li><li><span><a href="#4.1.7-validate检验的是到底哪一边出现了重复索引，如果是“one_to_one”则两侧索引都是唯一，如果&quot;one_to_many&quot;则左侧唯一" data-toc-modified-id="4.1.7-validate检验的是到底哪一边出现了重复索引，如果是“one_to_one”则两侧索引都是唯一，如果&quot;one_to_many&quot;则左侧唯一-5.1.0.7">4.1.7 validate检验的是到底哪一边出现了重复索引，如果是“one_to_one”则两侧索引都是唯一，如果"one_to_many"则左侧唯一</a></span></li><li><span><a href="#4.1.8-indicator参数指示了，合并后该行索引的来源" data-toc-modified-id="4.1.8-indicator参数指示了，合并后该行索引的来源-5.1.0.8">4.1.8 indicator参数指示了，合并后该行索引的来源</a></span></li></ul></li></ul></li><li><span><a href="#4.2.-join函数" data-toc-modified-id="4.2.-join函数-5.2">4.2. join函数</a></span><ul class="toc-item"><li><ul class="toc-item"><li><span><a href="#4.2.2-对于many_to_one模式下的合并，往往join更为方便" data-toc-modified-id="4.2.2-对于many_to_one模式下的合并，往往join更为方便-5.2.0.1">4.2.2 对于many_to_one模式下的合并，往往join更为方便</a></span></li><li><span><a href="#4.2.3-多层key：" data-toc-modified-id="4.2.3-多层key：-5.2.0.2">4.2.3 多层key：</a></span></li></ul></li></ul></li><li><span><a href="#5.1.-问题" data-toc-modified-id="5.1.-问题-5.3">5.1. 问题</a></span><ul class="toc-item"><li><span><a href="#5.1.1-【问题一】-请思考什么是append/assign/combine/update/concat/merge/join各自最适合使用的场景，并举出相应的例子。" data-toc-modified-id="5.1.1-【问题一】-请思考什么是append/assign/combine/update/concat/merge/join各自最适合使用的场景，并举出相应的例子。-5.3.1">5.1.1 【问题一】 请思考什么是append/assign/combine/update/concat/merge/join各自最适合使用的场景，并举出相应的例子。</a></span></li><li><span><a href="#5.1.2-【问题二】-merge_ordered和merge_asof的作用是什么？和merge是什么关系？" data-toc-modified-id="5.1.2-【问题二】-merge_ordered和merge_asof的作用是什么？和merge是什么关系？-5.3.2">5.1.2 【问题二】 merge_ordered和merge_asof的作用是什么？和merge是什么关系？</a></span></li><li><span><a href="#5.1.3-【问题三】-请构造一个多级索引与多级索引合并的例子，尝试使用不同的合并函数。" data-toc-modified-id="5.1.3-【问题三】-请构造一个多级索引与多级索引合并的例子，尝试使用不同的合并函数。-5.3.3">5.1.3 【问题三】 请构造一个多级索引与多级索引合并的例子，尝试使用不同的合并函数。</a></span></li><li><span><a href="#5.1.4-【问题四】-上文提到了连接的笛卡尔积，那么当连接方式变化时（inner/outer/left/right），这种笛卡尔积规则会相应变化吗？请构造相应例子。" data-toc-modified-id="5.1.4-【问题四】-上文提到了连接的笛卡尔积，那么当连接方式变化时（inner/outer/left/right），这种笛卡尔积规则会相应变化吗？请构造相应例子。-5.3.4">5.1.4 【问题四】 上文提到了连接的笛卡尔积，那么当连接方式变化时（inner/outer/left/right），这种笛卡尔积规则会相应变化吗？请构造相应例子。</a></span></li></ul></li><li><span><a href="#5.2.-练习" data-toc-modified-id="5.2.-练习-5.4">5.2. 练习</a></span><ul class="toc-item"><li><span><a href="#5.2.1-【练习一】有2张公司的员工信息表，每个公司共有16名员工，共有五个公司，请解决如下问题：" data-toc-modified-id="5.2.1-【练习一】有2张公司的员工信息表，每个公司共有16名员工，共有五个公司，请解决如下问题：-5.4.1">5.2.1 【练习一】有2张公司的员工信息表，每个公司共有16名员工，共有五个公司，请解决如下问题：</a></span><ul class="toc-item"><li><span><a href="#5.2.1.1-(a)-每个公司有多少员工满足如下条件：既出现第一张表，又出现在第二张表。" data-toc-modified-id="5.2.1.1-(a)-每个公司有多少员工满足如下条件：既出现第一张表，又出现在第二张表。-5.4.1.1">5.2.1.1 (a) 每个公司有多少员工满足如下条件：既出现第一张表，又出现在第二张表。</a></span></li><li><span><a href="#5.2.1.2-(b)-将所有不符合(a)中条件的行筛选出来，合并为一张新表，列名与原表一致。" data-toc-modified-id="5.2.1.2-(b)-将所有不符合(a)中条件的行筛选出来，合并为一张新表，列名与原表一致。-5.4.1.2">5.2.1.2 (b) 将所有不符合(a)中条件的行筛选出来，合并为一张新表，列名与原表一致。</a></span></li><li><span><a href="#5.2.1.3-(c)-现在需要编制所有80位员工的信息表，对于(b)中的员工要求不变，对于满足(a)条件员工，它们在某个指标的数值，取偏离它所属公司中满足(b)员工的均值数较小的哪一个，例如：P公司在两张表的交集为{p1}，并集扣除交集为{p2,p3,p4}，那么如果后者集合的工资均值为1万元，且p1在表1的工资为13000元，在表2的工资为9000元，那么应该最后取9000元作为p1的工资，最后对于没有信息的员工，利用缺失值填充。" data-toc-modified-id="5.2.1.3-(c)-现在需要编制所有80位员工的信息表，对于(b)中的员工要求不变，对于满足(a)条件员工，它们在某个指标的数值，取偏离它所属公司中满足(b)员工的均值数较小的哪一个，例如：P公司在两张表的交集为{p1}，并集扣除交集为{p2,p3,p4}，那么如果后者集合的工资均值为1万元，且p1在表1的工资为13000元，在表2的工资为9000元，那么应该最后取9000元作为p1的工资，最后对于没有信息的员工，利用缺失值填充。-5.4.1.3">5.2.1.3 (c) 现在需要编制所有80位员工的信息表，对于(b)中的员工要求不变，对于满足(a)条件员工，它们在某个指标的数值，取偏离它所属公司中满足(b)员工的均值数较小的哪一个，例如：P公司在两张表的交集为{p1}，并集扣除交集为{p2,p3,p4}，那么如果后者集合的工资均值为1万元，且p1在表1的工资为13000元，在表2的工资为9000元，那么应该最后取9000元作为p1的工资，最后对于没有信息的员工，利用缺失值填充。</a></span></li></ul></li><li><span><a href="#5.2.2-【练习二】有2张课程的分数表（分数随机生成），但专业课（学科基础课、专业必修课、专业选修课）与其他课程混在一起，请解决如下问题：" data-toc-modified-id="5.2.2-【练习二】有2张课程的分数表（分数随机生成），但专业课（学科基础课、专业必修课、专业选修课）与其他课程混在一起，请解决如下问题：-5.4.2">5.2.2 【练习二】有2张课程的分数表（分数随机生成），但专业课（学科基础课、专业必修课、专业选修课）与其他课程混在一起，请解决如下问题：</a></span><ul class="toc-item"><li><span><a href="#5.2.2.1-(a)-将两张表分别拆分为专业课与非专业课（结果为四张表）。" data-toc-modified-id="5.2.2.1-(a)-将两张表分别拆分为专业课与非专业课（结果为四张表）。-5.4.2.1">5.2.2.1 (a) 将两张表分别拆分为专业课与非专业课（结果为四张表）。</a></span></li><li><span><a href="#5.2.2.2-(b)-将两张专业课的分数表和两张非专业课的分数表分别合并。" data-toc-modified-id="5.2.2.2-(b)-将两张专业课的分数表和两张非专业课的分数表分别合并。-5.4.2.2">5.2.2.2 (b) 将两张专业课的分数表和两张非专业课的分数表分别合并。</a></span></li><li><span><a href="#5.2.2.3-(c)-不使用(a)中的步骤，请直接读取两张表合并后拆分。" data-toc-modified-id="5.2.2.3-(c)-不使用(a)中的步骤，请直接读取两张表合并后拆分。-5.4.2.3">5.2.2.3 (c) 不使用(a)中的步骤，请直接读取两张表合并后拆分。</a></span></li><li><span><a href="#5.2.2.4-(d)-专业课程中有缺失值吗，如果有的话请在完成(3)的同时，用组内（3种类型的专业课）均值填充缺失值后拆分。" data-toc-modified-id="5.2.2.4-(d)-专业课程中有缺失值吗，如果有的话请在完成(3)的同时，用组内（3种类型的专业课）均值填充缺失值后拆分。-5.4.2.4">5.2.2.4 (d) 专业课程中有缺失值吗，如果有的话请在完成(3)的同时，用组内（3种类型的专业课）均值填充缺失值后拆分。</a></span></li></ul></li></ul></li></ul></li></ul></div>

# chapter5 合并

In [3]:
import numpy as np
import pandas as pd
df = pd.read_csv('data/table.csv')
df.head()

  School Class    ID Gender   Address  Height  Weight  Math Physics
0    S_1   C_1  1101      M  street_1     173      63  34.0      A+
1    S_1   C_1  1102      F  street_2     192      73  32.5      B+
2    S_1   C_1  1103      M  street_2     186      82  87.2      B+
3    S_1   C_1  1104      F  street_2     167      81  80.4      B-
4    S_1   C_1  1105      F  street_4     159      64  84.8      B+

# 一、append与assign
## 1.1 append方法
### 1.1.1 利用序列添加行（必须指定name）

In [2]:
df_append = df.loc[:3,['Gender','Height']].copy()
df_append

  Gender  Height
0      M     173
1      F     192
2      M     186
3      F     167

In [3]:
s = pd.Series({'Gender':'F','Height':188},name='new_row')
df_append.append(s)

        Gender  Height
0            M     173
1            F     192
2            M     186
3            F     167
new_row      F     188

### 1.1.2 用DataFrame添加表

In [4]:
df_temp = pd.DataFrame({'Gender':['F','M'],'Height':[188,176]},index=['new_1','new_2'])
df_append.append(df_temp)

      Gender  Height
0          M     173
1          F     192
2          M     186
3          F     167
new_1      F     188
new_2      M     176

## 1.2 assign方法, 该方法主要用于添加列，列名直接由参数指定：

In [5]:
s = pd.Series(list('abcd'),index=range(4))
df_append.assign(Letter=s)

  Gender  Height Letter
0      M     173      a
1      F     192      b
2      M     186      c
3      F     167      d

* 可以一次添加多个列：

In [6]:
df_append.assign(col1=lambda x:x['Gender']*2,
                 col2=s)

  Gender  Height col1 col2
0      M     173   MM    a
1      F     192   FF    b
2      M     186   MM    c
3      F     167   FF    d

# 二、combine与update
## 2.1 combine方法
* combine和update都是用于表的填充函数，可以根据某种规则填充
### 2.1.1 填充对象
* 可以看出combine方法是按照表的顺序轮流进行逐列循环的，而且自动索引对齐，缺失值为NaN，理解这一点很重要

* DataFrame.combine(other, func, fill_value=None, overwrite=True)
* 基于传递的函数执行与另一个DataFrame的逐列组合。
* 使用func将DataFrame与其他 DataFrame 组合到按元素组合的列。生成的DataFrame的行索引和列索引将是两者的并集。
* 参数overwrite：默认为 True，当 df 中存在、other 中不存在时，可以通过该参数确定是否使用 other 的值填充 df
* 参数fill_value：默认为 None，用于填充缺失的值，以及结果中 “除去” 设置了，overwrite=False 列的空值
- 先进行填充，然后overwrite，如果other为NaN，则df覆盖为NaN，再进行函数判断

In [9]:
df_combine_1 = df.loc[:1,['Gender','Height']].copy()
df_combine_2 = df.loc[10:11,['Gender','Height']].copy()
df_combine_1.combine(df_combine_2,lambda x,y:print(x,y))

0       M
1       F
10    NaN
11    NaN
Name: Gender, dtype: object 0     NaN
1     NaN
10      M
11      F
Name: Gender, dtype: object
0     173.0
1     192.0
10      NaN
11      NaN
Name: Height, dtype: float64 0       NaN
1       NaN
10    161.0
11    175.0
Name: Height, dtype: float64

   Gender Height
0     NaN    NaN
1     NaN    NaN
10    NaN    NaN
11    NaN    NaN

### 2.1.2 一些例子
#### 2.1.2.1 例：根据列均值的大小填充

In [13]:
# 例子1
df1 = pd.DataFrame({'A': [1, 2], 'B': [3, 4]})
df2 = pd.DataFrame({'A': [8, 7], 'B': [6, 5]})
df1.combine(df2,lambda x,y:x if x.mean()>y.mean() else y)

   A  B
0  8  6
1  7  5

#### 2.1.2.2 例：索引对齐特性（默认状态下，后面的表没有的行列都会设置为NaN）

In [14]:
df1

   A  B
0  1  3
1  2  4

In [20]:
df2 = pd.DataFrame({'B': [8, 7], 'C': [6, 5]},index=[1,2])
df1.combine(df2,lambda x,y:x if x.mean()>y.mean() else y)

    A    B    C
0 NaN  NaN  NaN
1 NaN  8.0  6.0
2 NaN  7.0  5.0

#### 2.1.2.3 例：使得df1原来符合条件的值不会被覆盖

In [21]:
df1.combine(df2,lambda x,y:x if x.mean()>y.mean() else y,overwrite=False)

     A    B    C
0  1.0  NaN  NaN
1  2.0  8.0  6.0
2  NaN  7.0  5.0

#### 2.1.2.4 例：在新增匹配df2的元素位置填充-1

In [22]:
df1.combine(df2,lambda x,y:x if x.mean()>y.mean() else y,fill_value=-1)

     A    B    C
0  1.0 -1.0 -1.0
1  2.0  8.0  6.0
2 -1.0  7.0  5.0

### 2.1.3 combine_first方法
* 这个方法作用是用df2填补df1的缺失值，功能比较简单，但很多时候会比combine更常用，下面举两个例子：

In [23]:
df1 = pd.DataFrame({'A': [None, 0], 'B': [None, 4]})
df2 = pd.DataFrame({'A': [1, 1], 'B': [3, 3]})
df1.combine_first(df2)

     A    B
0  1.0  3.0
1  0.0  4.0

In [24]:
df1 = pd.DataFrame({'A': [None, 0], 'B': [4, None]})
df2 = pd.DataFrame({'B': [3, 3], 'C': [1, 1]}, index=[1, 2])
df1.combine_first(df2)

     A    B    C
0  NaN  4.0  NaN
1  0.0  3.0  1.0
2  NaN  3.0  1.0

## 2.2 update方法
### 2.2.1 三个特点
#### 2.2.1.2 返回的框索引只会与被调用框的一致（默认使用左连接，下一节会介绍）
#### 2.2.1.3 第二个框中的nan元素不会起作用
#### 2.2.1.4 没有返回值，直接在df上操作
### 2.2.2 例子
#### 2.2.2.1 例：索引完全对齐情况下的操作

In [25]:
df1 = pd.DataFrame({'A': [1, 2, 3],
                    'B': [400, 500, 600]})
df2 = pd.DataFrame({'B': [4, 5, 6],
                    'C': [7, 8, 9]})
df1.update(df2)
df1

   A  B
0  1  4
1  2  5
2  3  6

#### 2.2.2.2 例：部分填充

In [26]:
df1 = pd.DataFrame({'A': ['a', 'b', 'c'],
                    'B': ['x', 'y', 'z']})
df2 = pd.DataFrame({'B': ['d', 'e']}, index=[1,2])
df1.update(df2)
df1

   A  B
0  a  x
1  b  d
2  c  e

#### 2.2.2.3 例：缺失值不会填充

In [27]:
df1 = pd.DataFrame({'A': [1, 2, 3],
                    'B': [400, 500, 600]})
df2 = pd.DataFrame({'B': [4, np.nan, 6]})
df1.update(df2)
df1

   A      B
0  1    4.0
1  2  500.0
2  3    6.0

# 三、concat方法
* concat方法可以在两个维度上拼接，默认纵向拼接（axis=0），拼接方式默认外连接
* 所谓外连接，就是取拼接方向的并集，而'inner'时取拼接方向（若使用默认的纵向拼接，则为列的交集）的交集
* 下面举一些例子说明其参数：

In [28]:
df1 = pd.DataFrame({'A': ['A0', 'A1'],
                    'B': ['B0', 'B1']},
                    index = [0,1])
df2 = pd.DataFrame({'A': ['A2', 'A3'],
                    'B': ['B2', 'B3']},
                    index = [2,3])
df3 = pd.DataFrame({'A': ['A1', 'A3'],
                    'D': ['D1', 'D3'],
                    'E': ['E1', 'E3']},
                    index = [1,3])

#### 3.1 默认状态拼接：

In [29]:
pd.concat([df1,df2])

    A   B
0  A0  B0
1  A1  B1
2  A2  B2
3  A3  B3

#### 3.2 axis=1时沿列方向拼接：

In [30]:
pd.concat([df1,df2],axis=1)

     A    B    A    B
0   A0   B0  NaN  NaN
1   A1   B1  NaN  NaN
2  NaN  NaN   A2   B2
3  NaN  NaN   A3   B3

#### 3.3 join设置为内连接（由于axis=0，因此列取交集）：

In [31]:
pd.concat([df3,df1],join='inner')

    A
1  A1
3  A3
0  A0
1  A1

#### 3.4 join设置为外链接：

In [32]:
pd.concat([df3,df1],join='outer',sort=True) #sort设置列排序，默认为False

    A    B    D    E
1  A1  NaN   D1   E1
3  A3  NaN   D3   E3
0  A0   B0  NaN  NaN
1  A1   B1  NaN  NaN

#### 3.5 verify_integrity检查列是否唯一：

In [ ]:
#pd.concat([df3,df1],verify_integrity=True,sort=True) 报错

#### 3.6 同样，可以添加Series：

In [34]:
s = pd.Series(['X0', 'X1'], name='X')
pd.concat([df1,s],axis=1)

    A   B   X
0  A0  B0  X0
1  A1  B1  X1

#### 3.7 key参数用于对不同的数据框增加一个标号，便于索引：

In [35]:
pd.concat([df1,df2], keys=['x', 'y'])
pd.concat([df1,df2], keys=['x', 'y']).index

MultiIndex([('x', 0),
            ('x', 1),
            ('y', 2),
            ('y', 3)],
           )

# 四、merge与join
## 4.1. merge函数
* merge函数的作用是将两个pandas对象横向合并，遇到重复的索引项时会使用笛卡尔积，默认inner连接，可选left、outer、right连接
* 所谓左连接，就是指以第一个表索引为基准，右边的表中如果不在左边的则不加入，如果在左边的就以笛卡尔积的方式加入
* merge/join与concat的不同之处在于on参数，可以指定某一个对象为key来进行连接
* 同样的，下面举一些例子：

In [36]:
left = pd.DataFrame({'key1': ['K0', 'K0', 'K1', 'K2'],
                     'key2': ['K0', 'K1', 'K0', 'K1'],
                      'A': ['A0', 'A1', 'A2', 'A3'],
                      'B': ['B0', 'B1', 'B2', 'B3']}) 
right = pd.DataFrame({'key1': ['K0', 'K1', 'K1', 'K2'],
                      'key2': ['K0', 'K0', 'K0', 'K0'],
                      'C': ['C0', 'C1', 'C2', 'C3'],
                      'D': ['D0', 'D1', 'D2', 'D3']})
right2 = pd.DataFrame({'key1': ['K0', 'K1', 'K1', 'K2'],
                      'key2': ['K0', 'K0', 'K0', 'K0'],
                      'C': ['C0', 'C1', 'C2', 'C3']})

#### 4.1.1 以key1为准则连接，如果具有相同的列，则默认suffixes=('_x','_y')：

In [38]:
left

  key1 key2   A   B
0   K0   K0  A0  B0
1   K0   K1  A1  B1
2   K1   K0  A2  B2
3   K2   K1  A3  B3

In [39]:
right

  key1 key2   C   D
0   K0   K0  C0  D0
1   K1   K0  C1  D1
2   K1   K0  C2  D2
3   K2   K0  C3  D3

In [37]:
pd.merge(left, right, on='key1')

  key1 key2_x   A   B key2_y   C   D
0   K0     K0  A0  B0     K0  C0  D0
1   K0     K1  A1  B1     K0  C0  D0
2   K1     K0  A2  B2     K0  C1  D1
3   K1     K0  A2  B2     K0  C2  D2
4   K2     K1  A3  B3     K0  C3  D3

#### 4.1.2 以多组键连接：

In [40]:
pd.merge(left, right, on=['key1','key2'])

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

#### 4.1.3 默认使用inner连接，因为merge只能横向拼接，所以取行向上keys的交集，下面看如果使用how=outer参数
* 注意：这里的how就是concat的join

In [41]:
pd.merge(left, right, how='outer', on=['key1','key2'])

  key1 key2    A    B    C    D
0   K0   K0   A0   B0   C0   D0
1   K0   K1   A1   B1  NaN  NaN
2   K1   K0   A2   B2   C1   D1
3   K1   K0   A2   B2   C2   D2
4   K2   K1   A3   B3  NaN  NaN
5   K2   K0  NaN  NaN   C3   D3

#### 4.1.4 左连接：

In [42]:
pd.merge(left, right, how='left', on=['key1', 'key2'])

  key1 key2   A   B    C    D
0   K0   K0  A0  B0   C0   D0
1   K0   K1  A1  B1  NaN  NaN
2   K1   K0  A2  B2   C1   D1
3   K1   K0  A2  B2   C2   D2
4   K2   K1  A3  B3  NaN  NaN

#### 4.1.5 右连接：

In [44]:
pd.merge(left, right, how='right', on=['key1', 'key2'])

  key1 key2    A    B   C   D
0   K0   K0   A0   B0  C0  D0
1   K1   K0   A2   B2  C1  D1
2   K1   K0   A2   B2  C2  D2
3   K2   K0  NaN  NaN  C3  D3

#### 4.1.6 如果还是对笛卡尔积不太了解，请务必理解下面这个例子，由于B的所有元素为2，因此需要6行：

In [45]:
left = pd.DataFrame({'A': [1, 2], 'B': [2, 2]})
right = pd.DataFrame({'A': [4, 5, 6], 'B': [2, 2, 2]})
pd.merge(left, right, on='B', how='outer')

   A_x  B  A_y
0    1  2    4
1    1  2    5
2    1  2    6
3    2  2    4
4    2  2    5
5    2  2    6

In [46]:
pd.merge(left, right, on='B', how='inner')

   A_x  B  A_y
0    1  2    4
1    1  2    5
2    1  2    6
3    2  2    4
4    2  2    5
5    2  2    6

#### 4.1.7 validate检验的是到底哪一边出现了重复索引，如果是“one_to_one”则两侧索引都是唯一，如果"one_to_many"则左侧唯一

In [47]:
left = pd.DataFrame({'A': [1, 2], 'B': [2, 2]})
right = pd.DataFrame({'A': [4, 5, 6], 'B': [2, 3, 4]})
#pd.merge(left, right, on='B', how='outer',validate='one_to_one') #报错

In [48]:
left = pd.DataFrame({'A': [1, 2], 'B': [2, 1]})
pd.merge(left, right, on='B', how='outer',validate='one_to_one')

   A_x  B  A_y
0  1.0  2  4.0
1  2.0  1  NaN
2  NaN  3  5.0
3  NaN  4  6.0

#### 4.1.8 indicator参数指示了，合并后该行索引的来源

In [49]:
df1 = pd.DataFrame({'col1': [0, 1], 'col_left': ['a', 'b']})
df2 = pd.DataFrame({'col1': [1, 2, 2], 'col_right': [2, 2, 2]})
pd.merge(df1, df2, on='col1', how='outer', indicator=True) #indicator='indicator_column'也是可以的

   col1 col_left  col_right      _merge
0     0        a        NaN   left_only
1     1        b        2.0        both
2     2      NaN        2.0  right_only
3     2      NaN        2.0  right_only

## 4.2. join函数
* join函数作用是将多个pandas对象横向拼接，遇到重复的索引项时会使用笛卡尔积，默认左连接，可选inner、outer、right连接

In [50]:
left = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2']},
                    index=['K0', 'K1', 'K2'])
right = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                      'D': ['D0', 'D2', 'D3']},
                    index=['K0', 'K2', 'K3'])
left.join(right)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

#### 4.2.2 对于many_to_one模式下的合并，往往join更为方便
* 同样可以指定key：

In [51]:
left = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3'],
                     'key': ['K0', 'K1', 'K0', 'K1']})
right = pd.DataFrame({'C': ['C0', 'C1'],
                      'D': ['D0', 'D1']},
                     index=['K0', 'K1'])
left.join(right, on='key')

    A   B key   C   D
0  A0  B0  K0  C0  D0
1  A1  B1  K1  C1  D1
2  A2  B2  K0  C0  D0
3  A3  B3  K1  C1  D1

#### 4.2.3 多层key：

In [52]:
left = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3'],
                     'key1': ['K0', 'K0', 'K1', 'K2'],
                     'key2': ['K0', 'K1', 'K0', 'K1']})
index = pd.MultiIndex.from_tuples([('K0', 'K0'), ('K1', 'K0'),
                                   ('K2', 'K0'), ('K2', 'K1')],names=['key1','key2'])
right = pd.DataFrame({'C': ['C0', 'C1', 'C2', 'C3'],
                      'D': ['D0', 'D1', 'D2', 'D3']},
                     index=index)
left.join(right, on=['key1','key2'])

    A   B key1 key2    C    D
0  A0  B0   K0   K0   C0   D0
1  A1  B1   K0   K1  NaN  NaN
2  A2  B2   K1   K0   C1   D1
3  A3  B3   K2   K1   C3   D3

In [ ]:
# 五、问题与练习

## 5.1. 问题
### 5.1.1 【问题一】 请思考什么是append/assign/combine/update/concat/merge/join各自最适合使用的场景，并举出相应的例子。

* append/assign：利用Series或DataFrame添加行/列
* combine/update：利用规则在表中填充另一个表的数据，或覆盖更新数据
* concat：行/列两个方向拼接两个表。
* merge/join：横向拼接（笛卡尔积方式），适用于多级索引的情况。 join更适用于many_to_one模式和多个df对象


### 5.1.2 【问题二】 merge_ordered和merge_asof的作用是什么？和merge是什么关系？

* merge_ordered:
函数允许组合时间序列和其他有序数据。 特别是它有一个可选的fill_method关键字来填充/插入缺失的数据。

* merge_asof
除了我们匹配最近的键而不是相等的键之外，其他的都类似于有序的left-join 。 对于左侧DataFrame中的每一行，我们选择右侧DataFrame中on键对应的值小于left的键对应的值的最后一行。 两个DataFrame必须按键排序。


### 5.1.3 【问题三】 请构造一个多级索引与多级索引合并的例子，尝试使用不同的合并函数。
### 5.1.4 【问题四】 上文提到了连接的笛卡尔积，那么当连接方式变化时（inner/outer/left/right），这种笛卡尔积规则会相应变化吗？请构造相应例子。

* 不会，因为都是两者df都存在的

## 5.2. 练习
### 5.2.1 【练习一】有2张公司的员工信息表，每个公司共有16名员工，共有五个公司，请解决如下问题：

In [53]:
pd.read_csv('data/Employee1.csv').head()

  Company Name  Age  Height  Weight  Salary
0       A   a1   47     188    63.7   25819
1       A   a3   39     172    55.9   21983
2       A   a4   43     158    62.5   21755
3       A   a6   42     182    76.9   17354
4       A   a7   49     171    94.6    6177

In [54]:
pd.read_csv('data/Employee2.csv').head()

  Company Name  Age  Height  Weight  Salary
0       A   a1   30     156    91.2   28133
1       A   a2   50     190    83.4    6673
2       A   a3   34     168    96.6   16503
3       A   a5   51     176    97.2   23294
4       A   a6   37     183    93.2   19256

#### 5.2.1.1 (a) 每个公司有多少员工满足如下条件：既出现第一张表，又出现在第二张表。

In [4]:
df1 = pd.read_csv('data/Employee1.csv')
df2 = pd.read_csv('data/Employee2.csv')

In [5]:
L = list(set(df1['Name']).intersection(set(df2['Name'])))
len(L)

16

#### 5.2.1.2 (b) 将所有不符合(a)中条件的行筛选出来，合并为一张新表，列名与原表一致。

In [6]:
df_b1 = df1[~df1['Name'].isin(L)]
df_b2 = df2[~df2['Name'].isin(L)]
df_b = pd.concat([df_b1,df_b2]).set_index('Name')
df_b.head()

     Company  Age  Height  Weight  Salary
Name
a4         A   43     158    62.5   21755
a7         A   49     171    94.6    6177
a8         A   51     168    89.5    3246
a9         A   36     186    62.8    3569
a13        A   58     190    75.9   21854

#### 5.2.1.3 (c) 现在需要编制所有80位员工的信息表，对于(b)中的员工要求不变，对于满足(a)条件员工，它们在某个指标的数值，取偏离它所属公司中满足(b)员工的均值数较小的哪一个，例如：P公司在两张表的交集为{p1}，并集扣除交集为{p2,p3,p4}，那么如果后者集合的工资均值为1万元，且p1在表1的工资为13000元，在表2的工资为9000元，那么应该最后取9000元作为p1的工资，最后对于没有信息的员工，利用缺失值填充。

In [7]:
df1 = pd.read_csv('data/Employee1.csv')
df2 = pd.read_csv('data/Employee2.csv')
df1['重复'] = ['Y_1' if df1.loc[i,'Name'] in L else 'N' for i in range(df1.shape[0])]
df2['重复'] = ['Y_2' if df2.loc[i,'Name'] in L else 'N' for i in range(df2.shape[0])]
df1 = df1.set_index(['Name','重复'])
df2 = df2.set_index(['Name','重复'])
df_c = pd.concat([df1,df2])
result = pd.DataFrame({'Company':[],'Name':[],'Age':[],'Height':[],'Weight':[],'Salary':[]})
group = df_c.groupby(['Company','重复'])
for i in L:
    first = group.get_group((i[0].upper(),'Y_1')).reset_index(level=1).loc[i,:][-4:]
    second = group.get_group((i[0].upper(),'Y_2')).reset_index(level=1).loc[i,:][-4:]
    mean = group.get_group((i[0].upper(),'N')).reset_index(level=1).mean()
    final = [i[0].upper(),i]
    for j in range(4):
        final.append(first[j] if abs(first[j]-mean[j])<abs(second[j]-mean[j]) else second[j])
    result = pd.concat([result,pd.DataFrame({result.columns.tolist()[k]:[final[k]] for k in range(6)})])
result = pd.concat([result.set_index('Name'),df_b])
for i in list('abcde'):
    for j in range(1,17):
        item = i+str(j)
        if item not in result.index:
            result = pd.concat([result,pd.DataFrame({'Company':[i.upper()],'Name':[item]
                 ,'Age':[np.nan],'Height':[np.nan],'Weight':[np.nan],'Salary':[np.nan]}).set_index('Name')])
result['Number'] = [int(i[1:]) for i in result.index]
result.reset_index().drop(columns='Name').set_index(['Company','Number']).sort_index()

                 Age  Height  Weight   Salary
Company Number
A       1       47.0   188.0    91.2  25819.0
        2       50.0   190.0    83.4   6673.0
        3       39.0   172.0    96.6  16503.0
        4       43.0   158.0    62.5  21755.0
        5       51.0   176.0    97.2  23294.0
...              ...     ...     ...      ...
E       12      54.0   157.0    79.4  18490.0
        13      57.0   180.0    54.8  26837.0
        14      39.0   163.0    83.0  20554.0
        15       NaN     NaN     NaN      NaN
        16       NaN     NaN     NaN      NaN

[80 rows x 4 columns]

### 5.2.2 【练习二】有2张课程的分数表（分数随机生成），但专业课（学科基础课、专业必修课、专业选修课）与其他课程混在一起，请解决如下问题：

In [8]:
pd.read_csv('data/Course1.csv').head()

          课程名字   课程类别  学分    分数
0  思想道德修养与法律基础    思政类   3  89.0
1     云计算应用与开发  专业选修课   3  96.0
2         社会计算  专业选修课   3  78.0
3         深度学习  专业选修课   3  75.0
4       人工智能导论  专业必修课   3  84.0

In [9]:
pd.read_csv('data/Course2.csv').head()

        课程名字   课程类别  学分     分数
0    高等数学（一）  学科基础课   4   99.0
1  数据科学与工程导论  学科基础课   3    NaN
2       专业英语  学科基础课   2  100.0
3        概率论  学科基础课   3   99.0
4      计算机系统  专业必修课   4   80.0

#### 5.2.2.1 (a) 将两张表分别拆分为专业课与非专业课（结果为四张表）。

In [10]:
df1 = pd.read_csv('data/Course1.csv')
df2 = pd.read_csv('data/Course2.csv')
df_a11,df_a12,df_a21,df_a22 =0,0,0,0
df_a11= df1.query('课程类别 in ["学科基础课","专业必修课","专业选修课"]')
df_a12= df1.query('课程类别 not in ["学科基础课","专业必修课","专业选修课"]')
df_a21= df2.query('课程类别 in ["学科基础课","专业必修课","专业选修课"]')
df_a22= df2.query('课程类别 not in ["学科基础课","专业必修课","专业选修课"]')
df_a11.head()

       课程名字   课程类别  学分    分数
1  云计算应用与开发  专业选修课   3  96.0
2      社会计算  专业选修课   3  78.0
3      深度学习  专业选修课   3  75.0
4    人工智能导论  专业必修课   3  84.0
6   数据结构与算法  学科基础课   5  82.0

#### 5.2.2.2 (b) 将两张专业课的分数表和两张非专业课的分数表分别合并。

In [11]:
special = pd.concat([df_a11,df_a21])
common = pd.concat([df_a12,df_a22])
special.query('课程类别 not in ["学科基础课","专业必修课","专业选修课"]')

Empty DataFrame
Columns: [课程名字, 课程类别, 学分, 分数]
Index: []

In [12]:
common.query('课程类别 in ["学科基础课","专业必修课","专业选修课"]')

Empty DataFrame
Columns: [课程名字, 课程类别, 学分, 分数]
Index: []

#### 5.2.2.3 (c) 不使用(a)中的步骤，请直接读取两张表合并后拆分。

In [13]:
df = pd.concat([df1,df2])
special2 = df.query('课程类别 in ["学科基础课","专业必修课","专业选修课"]')
common2 = df.query('课程类别 not in ["学科基础课","专业必修课","专业选修课"]')
(special.equals(special2),common.equals(common2))

(True, True)

#### 5.2.2.4 (d) 专业课程中有缺失值吗，如果有的话请在完成(3)的同时，用组内（3种类型的专业课）均值填充缺失值后拆分。

In [14]:
df['分数'] = df.groupby('课程类别').transform(lambda x: x.fillna(x.mean()))['分数']
df.isnull().all()

课程名字    False
课程类别    False
学分      False
分数      False
dtype: bool

In [15]:
special3 = df.query('课程类别 in ["学科基础课","专业必修课","专业选修课"]')
common3 = df.query('课程类别 not in ["学科基础课","专业必修课","专业选修课"]')
common3.head()

            课程名字     课程类别  学分    分数
0    思想道德修养与法律基础      思政类   3  89.0
5        中国近代史纲要      思政类   3  97.0
8          网球（初）      体育类   1  81.0
10  极端性气候与陆地生态系统  公共任意选修类   2  78.0
13         游泳（初）      体育类   1  75.0